# OrdinateDimensionSetting Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OrdinateDimensionSetting Class
Members See Also
---
Represents a collection of Ordinate Dimension settings that can be associated to an ordinate DimensionType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public class OrdinateDimensionSetting : IDisposable
```

Visual Basic
---
```text
Public Class OrdinateDimensionSetting _
	Implements IDisposable
```

Visual C++
---
```text
public ref class OrdinateDimensionSetting : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..OrdinateDimensionSetting
# See Also
OrdinateDimensionSetting Members
Autodesk.Revit.DB Namespace